using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace RevitAPISheetAndViews
{
    //создать приложение, которое при нажатии на несущий ж/б элемент сделает его прозрачным
    //а всю принадлежащую ему арматуру по метке основы сделает солид и покрасит в зеленый цвет
    //арматуру, которая находится внутри элемента, но ему не принадлежит подсветит  красным
    //по выборе соответствующего переключателя можно вернуть отображение элемента и арматуры
    //на 3D виде в состояние по умолчанию

    class MainViewViewModel
    {

    }
}
